Wednesday.yml
config:
  target: "https://canon.stores2.shoptimize.in"
  phases:
    - duration: 30
      arrivalRate: 8
      name: "Warm-up"

  payload:
    path: "canon.csv"
    fields:
      - q

  defaults:
    headers:
      accept: "application/json"
    timeout: 11# Short timeout for quick failures

  http:
    maxRedirects: 0  
    # retries not set = default 0

scenarios:
  - flow:
      - get:
          url: "/catalogsearch/result/?q={{ q }}"
          expect:
            - statusCode: 200  # Only 200 OK is valid
      - think: 5